scc2425-tukano/src/main/test/Artillery_Tests/create_short_n_blob.yaml
config:
  target: http://127.0.0.1:8080/tukano/rest 
  phases:
    - name: create_short_n_upload_blob
      duration: 1 
      arrivalRate: 1 

scenarios:
  - name: TuKanoHome
    flow:
      - post:
          url: /shorts/Pao?pwd=baguette
          capture: 
            json: '$'  
            as: 'response'  

      - post:
          url: '{{ response.blobUrl }}'