scc2425-tukano/src/main/test/Artillery_Tests/follow_n_getFollowers.yaml
config:
  target: http://127.0.0.1:8080/tukano/rest
  phases:
    - name: simple_post_short
      duration: 1 
      arrivalRate: 1 

scenarios:
  - name: TuKanoHome
    flow:
      - post:
          url: /shorts/Cambio/Pao/followers?isFollowing=true&pwd=easypass

      - get:
          url: /shorts/Pao/followers?pwd=baguette